# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
number = [1, 2,-8, 8, 7, 10, -7, -2, -1]
sum = 0
for n in number:
        sum += n
print(sum)
