
number = float(input()) 
if number > 0:
print("Данное число подложительное")
else: 
print("Данное число отрицательное")



# Примечание: код самих print'ов не менять!
# Дано вещественное число x. Проверьте, является ли оно положительным или отрицательным.
# Формат входных данных: дано одно вещественное число number. Гарантируется, что number ≠ 0.
# Формат выходных данных: Требуется вывести тип числа текстом

 # Считываем вещественное число
